app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"
---
  def index
    @reservations = Reservation.all