app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations"  ORDER BY reservation_date, hour
---
  def index
    @reservations = Reservation.all.order('reservation_date, hour')

SELECT "tables".* FROM "tables" INNER JOIN "reservations" ON "reservations"."table_id" = "tables"."id" WHERE ("reservations"."reservation_date" != $1) AND ("reservations"."hour" != $2)  [["reservation_date", "2017-01-01"], ["hour", 1]]
SELECT "tables".* FROM "tables"  ORDER BY "tables"."num_of_seats" ASC
INSERT INTO "reservations" ("name", "table_id", "num_of_seats_reserved", "reservation_date", "hour", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # I couldn't get the where.not to return the tables that were not reserved at the time so I queried the reserved tables and subtracted them from all tables to find the available.

    reserved_tables = Table.joins(:reservations).merge(Reservation.where(reservation_date: reservation_params[:reservation_date], hour: reservation_params[:hour]))
    all_tables = Table.all.order(:num_of_seats)
    available_tables = all_tables - reserved_tables
    total_capacity_available = 0

    available_tables.each do |table|
      total_capacity_available += table.num_of_seats
    end

    if total_capacity_available < reservation_params[:num_of_seats_reserved].to_i
      flash[:alert] = "Reservation Failed: Seating Capacity Exceeded"
    elsif available_tables[-1].num_of_seats >= reservation_params[:num_of_seats_reserved].to_i
      available_tables.each do |table|
        if table.num_of_seats >= reservation_params[:num_of_seats_reserved].to_i
          @reservation = Reservation.new(name: reservation_params[:name], table: table, num_of_seats_reserved: reservation_params[:num_of_seats_reserved], reservation_date: reservation_params[:reservation_date], hour: reservation_params[:hour])
          @reservation.save