app/controllers/reservations_controller.rb

SELECT "tables".* FROM "tables"
---
  def create
    # I couldn't get the where.not to return the tables that were not reserved at the time so I queried the reserved tables and subtracted them from all tables to find the available.

    reserved_tables = Table.joins(:reservations).merge(Reservation.where(reservation_date: reservation_params[:reservation_date], hour: reservation_params[:hour]))

    all_tables = Table.all